#coding=utf8

STATUS_CHOICES = {
    100: u'Сообщение принято к отправке. На следующих строчках вы найдете идентификаторы отправленных сообщений '
         u'в том же порядке, в котором вы указали номера, на которых совершалась отправка.',

    101: u'Сообщение передается оператору',
    102: u'Сообщение отправлено (в пути)',
    103: u'Сообщение доставлено',
    104: u'Не может быть доставлено: время жизни истекло',
    105: u'Не может быть доставлено: удалено оператором',
    106: u'Не может быть доставлено: сбой в телефоне',
    107: u'Не может быть доставлено: неизвестная причина',
    108: u'Не может быть доставлено: отклонено',

    200: u'Неправильный api_id.',
    201: u'Не хватает средств на лицевом счету',
    202: u'Неправильно указан получатель',
    203: u'Нет текста сообщения',
    204: u'Имя отправителя не согласовано с администрацией',
    205: u'Сообщение слишком длинное (превышает 8 СМС)',
    206: u'Будет превышен или уже превышен дневной лимит на отправку сообщений',
    207: u'На этот номер (или один из номеров) нельзя отправлять сообщения, либо указано более 100 номеров в списке '
         u'получателей',
    208: u'Параметр time указан неправильно',
    209: u'Вы добавили этот номер (или один из номеров) в стоп-лист',
    210: u'Используется GET, где необходимо использовать POST',
    211: u'Метод не найден',
    212: u'Текст сообщения необходимо передать в кодировке UTF-8 (вы передали в другой кодировке)',
    220: u'Сервис временно недоступен, попробуйте чуть позже.',
    230: u'Сообщение не принято к отправке, так как на один номер в день нельзя отправлять более 250 сообщений.',
    300: u'Неправильный token (возможно истек срок действия, либо ваш IP изменился)',
    301: u'Неправильный пароль, либо пользователь не найден',
    302: u'Пользователь авторизован, но аккаунт не подтвержден (пользователь не ввел код, присланный в регистрационной смс)'
}